Ran Plan for 3 projects:

1. dir: `infra/gcp/terraform/k8s-infra-prow-build-trusted` workspace: `default`
1. dir: `infra/gcp/terraform/k8s-infra-prow-build` workspace: `default`
1. dir: `infra/gcp/terraform/k8s-infra-releases-prod` workspace: `default`
---

### 1. dir: `infra/gcp/terraform/k8s-infra-prow-build-trusted` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #7953. To continue, delete the lock from #7953 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 2. dir: `infra/gcp/terraform/k8s-infra-prow-build` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # module.project.google_project.project will be updated in-place
~ resource "google_project" "project" {
      ~ deletion_policy     = "DELETE" -> "PREVENT"
        id                  = "projects/k8s-infra-prow-build"
        name                = "k8s-infra-prow-build"
        # (9 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infra/gcp/terraform/k8s-infra-prow-build
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.k8s.io/lock?id=kubernetes%252Fk8s.io%252Finfra%252Fgcp%252Fterraform%252Fk8s-infra-prow-build%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infra/gcp/terraform/k8s-infra-prow-build
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 3. dir: `infra/gcp/terraform/k8s-infra-releases-prod` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform plan -input=false -refresh -out \"/atlantis/repos/kubernetes/k8s.io/8029/default/infra/gcp/terraform/k8s-infra-releases-prod/default.tfplan\"" in "/atlantis/repos/kubernetes/k8s.io/8029/default/infra/gcp/terraform/k8s-infra-releases-prod": exit status 1
google_project.project: Refreshing state... [id=projects/k8s-infra-releases-prod]
google_pubsub_topic.topic: Refreshing state... [id=projects/k8s-infra-releases-prod/topics/kubernetes_release_backups]
module.k8s_releases_prod.google_project_service.service["storage.googleapis.com"]: Refreshing state... [id=k8s-infra-releases-prod/storage.googleapis.com]
module.k8s_releases_prod.google_project_service.service["storageinsights.googleapis.com"]: Refreshing state... [id=k8s-infra-releases-prod/storageinsights.googleapis.com]
google_service_account.fastly_reader: Refreshing state... [id=projects/k8s-infra-releases-prod/serviceAccounts/fastly-reader@k8s-infra-releases-prod.iam.gserviceaccount.com]
module.k8s_releases_prod.google_project_service.service["storage-api.googleapis.com"]: Refreshing state... [id=k8s-infra-releases-prod/storage-api.googleapis.com]
module.k8s_releases_prod.google_project_service.service["storage-component.googleapis.com"]: Refreshing state... [id=k8s-infra-releases-prod/storage-component.googleapis.com]
module.k8s_releases_prod.google_project_service.service["secretmanager.googleapis.com"]: Refreshing state... [id=k8s-infra-releases-prod/secretmanager.googleapis.com]
module.k8s_releases_prod.google_project_service.service["storagetransfer.googleapis.com"]: Refreshing state... [id=k8s-infra-releases-prod/storagetransfer.googleapis.com]
module.k8s_releases_prod.google_storage_bucket.k8s_releases: Refreshing state... [id=767373bbdcb8270361b96548387bf2a9ad0d48758c35]
google_storage_hmac_key.fastly_reader_key: Refreshing state... [id=projects/k8s-infra-releases-prod/hmacKeys/GOOG1E2W2CXGJ265QKIZNREHEP67TL3GITK6PEIGWHWPXR4JPDT2UYYPVG2CV]
google_storage_bucket_iam_policy.releng_access_policy: Refreshing state... [id=b/767373bbdcb8270361b96548387bf2a9ad0d48758c35]
google_pubsub_topic_iam_member.notification_config: Refreshing state... [id=projects/k8s-infra-releases-prod/topics/kubernetes_release_backups/roles/pubsub.publisher/serviceAccount:project-236990870955@storage-transfer-service.iam.gserviceaccount.com]
module.secrets.google_secret_manager_secret.secrets["fastly_reader_sa_access_key"]: Refreshing state... [id=projects/k8s-infra-releases-prod/secrets/fastly_reader_sa_access_key]
module.secrets.google_secret_manager_secret.secrets["fastly_reader_sa_secret_key"]: Refreshing state... [id=projects/k8s-infra-releases-prod/secrets/fastly_reader_sa_secret_key]
module.secrets.google_secret_manager_secret_version.secret-version["fastly_reader_sa_access_key"]: Refreshing state... [id=projects/236990870955/secrets/fastly_reader_sa_access_key/versions/1]
module.secrets.google_secret_manager_secret_version.secret-version["fastly_reader_sa_secret_key"]: Refreshing state... [id=projects/236990870955/secrets/fastly_reader_sa_secret_key/versions/1]
google_storage_bucket_iam_member.gcs-backup-bucket: Refreshing state... [id=b/767373bbdcb8270361b96548387bf2a9ad0d48758c35/roles/storage.admin/serviceAccount:project-236990870955@storage-transfer-service.iam.gserviceaccount.com]
google_storage_transfer_job.kubernetes_release_backup: Refreshing state... [id=k8s-infra-releases-prod/1591874656549722328]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.google_iam_policy.releng_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_iam_policy" "releng_access" {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + "group:k8s-infra-release-editors@kubernetes.io",
              + "projectViewer:k8s-infra-releases-prod",
            ]
          + role    = "roles/storage.legacyBucketReader"
        }
      + binding {
          + members = [
              + "group:k8s-infra-release-editors@kubernetes.io",
              + "serviceAccount:fastly-reader@k8s-infra-releases-prod.iam.gserviceaccount.com",
            ]
          + role    = "roles/storage.objectViewer"
        }
      + binding {
          + members = [
              + "projectEditor:k8s-infra-releases-prod",
              + "projectOwner:k8s-infra-releases-prod",
            ]
          + role    = "roles/storage.legacyBucketOwner"
        }
      + binding {
          + members = [
              + "serviceAccount:648026197307@cloudbuild.gserviceaccount.com",
            ]
          + role    = "roles/storage.objectAdmin"
        }
    }

  # data.google_storage_transfer_project_service_account.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_storage_transfer_project_service_account" "default" {
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + project    = "k8s-infra-releases-prod"
      + subject_id = (known after apply)
    }

  # google_project.project will be updated in-place
  ~ resource "google_project" "project" {
      ~ deletion_policy     = "DELETE" -> "PREVENT"
        id                  = "projects/k8s-infra-releases-prod"
        name                = "k8s-infra-releases-prod"
        # (9 unchanged attributes hidden)
    }

  # google_pubsub_topic_iam_member.notification_config must be replaced
-/+ resource "google_pubsub_topic_iam_member" "notification_config" {
      ~ etag    = "BwYJCmMs45A=" -> (known after apply)
      ~ id      = "projects/k8s-infra-releases-prod/topics/kubernetes_release_backups/roles/pubsub.publisher/serviceAccount:project-236990870955@storage-transfer-service.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:project-236990870955@storage-transfer-service.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # google_storage_bucket_iam_member.gcs-backup-bucket will be created
  + resource "google_storage_bucket_iam_member" "gcs-backup-bucket" {
      + bucket = "767373bbdcb8270361b96548387bf2a9ad0d48758c35"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.admin"
    }

  # google_storage_bucket_iam_policy.releng_access_policy will be updated in-place
  ~ resource "google_storage_bucket_iam_policy" "releng_access_policy" {
        id          = "b/767373bbdcb8270361b96548387bf2a9ad0d48758c35"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "projectEditor:k8s-infra-releases-prod",
                          - "projectOwner:k8s-infra-releases-prod",
                        ]
                      - role    = "roles/storage.legacyBucketOwner"
                    },
                  - {
                      - members = [
                          - "group:k8s-infra-release-editors@kubernetes.io",
                          - "projectViewer:k8s-infra-releases-prod",
                        ]
                      - role    = "roles/storage.legacyBucketReader"
                    },
                  - {
                      - members = [
                          - "serviceAccount:648026197307@cloudbuild.gserviceaccount.com",
                        ]
                      - role    = "roles/storage.objectAdmin"
                    },
                  - {
                      - members = [
                          - "group:k8s-infra-release-editors@kubernetes.io",
                          - "serviceAccount:fastly-reader@k8s-infra-releases-prod.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/storage.objectViewer"
                    },
                ]
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  - access_key = "GOOG1E2W2CXGJ265QKIZNREHEP67TL3GITK6PEIGWHWPXR4JPDT2UYYPVG2CV" -> null
  - secret_key = "r0hh9tUXLpLGzF+toIynnPnQXs8b6RL4xXge70OT" -> null
╷
│ Error: Error when reading or editing Transfer Job "transferJobs/1591874656549722328": googleapi: Error 403: Storage Transfer API has not been used in project 270672962129 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/storagetransfer.googleapis.com/overview?project=270672962129 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry.
│ Details:
│ [
│   {
│     "@type": "type.googleapis.com/google.rpc.ErrorInfo",
│     "domain": "googleapis.com",
│     "metadata": {
│       "activationUrl": "https://console.developers.google.com/apis/api/storagetransfer.googleapis.com/overview?project=270672962129",
│       "consumer": "projects/270672962129",
│       "containerInfo": "270672962129",
│       "service": "storagetransfer.googleapis.com",
│       "serviceTitle": "Storage Transfer API"
│     },
│     "reason": "SERVICE_DISABLED"
│   },
│   {
│     "@type": "type.googleapis.com/google.rpc.LocalizedMessage",
│     "locale": "en-US",
│     "message": "Storage Transfer API has not been used in project 270672962129 before or it is disabled. Enable it by visiting https://console.developers.google.com/apis/api/storagetransfer.googleapis.com/overview?project=270672962129 then retry. If you enabled this API recently, wait a few minutes for the action to propagate to our systems and retry."
│   },
│   {
│     "@type": "type.googleapis.com/google.rpc.Help",
│     "links": [
│       {
│         "description": "Google developers console API activation",
│         "url": "https://console.developers.google.com/apis/api/storagetransfer.googleapis.com/overview?project=270672962129"
│       }
│     ]
│   }
│ ]
│ , accessNotConfigured
│ 
│   with google_storage_transfer_job.kubernetes_release_backup,
│   on main.tf line 71, in resource "google_storage_transfer_job" "kubernetes_release_backup":
│   71: resource "google_storage_transfer_job" "kubernetes_release_backup" {
│ 
╵

```
</details>

---
### Plan Summary

3 projects, 1 with changes, 0 with no changes, 2 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```